Тестовая_база_ERP_14/src/Catalogs/РЭЙ_ВидыЗадачПользователей/РЭЙ_ВидыЗадачПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЭЙ_ВидыЗадачПользователей</name>
  <predefined>
    <items>
      <name>ПаспортСделкиПереоформлениеСрок</name>
      <description>ЗПУК: Переоформление при превышении срока контракта ВЭД</description>
    </items>
    <items>
      <name>ПаспортСделкиПереоформлениеСумма</name>
      <description>ЗПУК: Переоформление при превышении суммы контракта ВЭД</description>
    </items>
    <items>
      <name>КонтрактВЭДПодтверждениеАвтопролонгации</name>
      <description>ЗПУК: Подтверждение автопролонгации контракта ВЭД</description>
    </items>
    <items>
      <name>КонтрактВЭД</name>
      <description>ЗПУК: Создание контракта ВЭД</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствВИностраннойВалюте</name>
      <description>СКВО: Зачисление ДС на валютные счета</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствНаРублевыеСчета</name>
      <description>СКВО: Зачисление ДС на рублевые счета</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствЧерезСчетаЗаРубежом</name>
      <description>СКВО: Зачисление ДС на счета за рубежом</description>
    </items>
    <items>
      <name>ОжидаемыйСрокСВО</name>
      <description>СКВО: Ожидаемый срок</description>
    </items>
    <items>
      <name>СписаниеДенежныхСредствСВалютныхСчетов</name>
      <description>СКВО: Списание ДС с валютных счетов</description>
    </items>
    <items>
      <name>СписаниеДенежныхСредствСРублевыхСчетов</name>
      <description>СКВО: Списание ДС с рублевых счетов</description>
    </items>
    <items>
      <name>СписаниеДенежныхСредствЧерезСчетаЗаРубежом</name>
      <description>СКВО: Списание ДС со счетов за рубежом</description>
    </items>
    <items>
      <name>ОжидаемыйСрокСПД</name>
      <description>СПД:   Ожидаемый срок</description>
    </items>
    <items>
      <name>ПоступлениеДопРасходов</name>
      <description>СПД:   Поступление доп. расходов</description>
    </items>
    <items>
      <name>ПоступлениеТоваровУслуг</name>
      <description>СПД:   Поступление товаров и услуг / ГТД по импорту</description>
    </items>
    <items>
      <name>РеализацияТоваровУслуг</name>
      <description>СПД:   Реализация товаров и услуг</description>
    </items>
  </predefined>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/РЭЙ_ВидыЗадачПользователей/ManagerModule.bsl
Процедура УстановитьИнициализационныеНастройки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РЭЙ_ВидыЗадачПользователей.Ссылка
	|ИЗ
	|	Справочник.РЭЙ_ВидыЗадачПользователей КАК РЭЙ_ВидыЗадачПользователей
	|ГДЕ
	|	РЭЙ_ВидыЗадачПользователей.Использование = ЛОЖЬ
	|	И РЭЙ_ВидыЗадачПользователей.ИзмененВручную = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		текОбъект = Выборка.Ссылка.ПолучитьОбъект();
		текОбъект.Использование = Истина;
		текОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
